{
  "folders": ["pkg", "platforms"],
  "excludeFolders": ["examples", "node_modules"],
  "excludeFiles": ["*.test.ts", "*.config.*"],
  "rules": [
    "This library is designed for serverless and edge environments where traditional TCP connections are not available",
    "Always use HTTP/REST based methods instead of direct TCP connections",
    "Import from '@upstash/redis' for standard usage or specific platform exports for edge runtimes",
    "Use Redis.fromEnv() to automatically load credentials from environment variables",
    "All commands are async and return Promises - always use await or .then()",
    "Commands follow Redis protocol but return parsed JavaScript values automatically",
    "This is rule 7",
    "This is rule 8",
    "This is rule 9",
    "This is rule 10",
    "This is rule 11",
    "This is rule 12",
    "This is rule 13",
    "This is rule 14",
    "This is rule 15",
    "This is rule 16",
    "This is rule 17",
    "This is rule 18",
    "This is rule 19",
    "This is rule 20",
    "This is rule 21",
    "This is rule 22",
    "This is rule 23",
    "This is rule 24",
    "This is rule 25",
    "This is rule 26",
    "This is rule 27"
  ],
  "benchmarkQuestions": [
    "How do I initialize a Redis client in serverless environments?",
    "What is the difference between Redis.fromEnv() and creating a new Redis instance?",
    "How do I handle connection errors in edge runtime environments?",
    "Can I use Redis pipelines with this library?",
    "How do I implement rate limiting using Redis?",
    "This is a very long benchmark question that exceeds the maximum character limit of 500 characters. Let me keep typing to make this really long so it will definitely exceed validation. I need to add more and more text here to reach that 500 character limit. This question is intentionally made extremely verbose and unnecessarily long to test the validation logic in the schema. We want to ensure that the system properly rejects questions that are too long and provides appropriate error messages to users who might accidentally create overly lengthy benchmark questions in their configuration files. Adding even more text now to absolutely guarantee we exceed 500 chars limit."
  ],
  "previousVersions": []
}

